Repository: yeager/swedish-tm
Catalog: reviewed/catalogs/piper.tmx
Source language: en
Languages: sv

source: Piper is a graphical user interface to configure gaming mice. Configuration options include changing the resolution (DPI) of the mouse, adding and removing profiles, setting LED colors and changing button behaviors.
sv: Piper är ett användargränssnitt för att konfigurera möss. Det finns optioner för att ändra musens upplösning (DPI), lägga till och ta bort profiler, ställa in LED färger och ändra knappbindningar.

source: Choose an effect duration for the LED
sv: Välj en effektfrekvens för lysdioden

source: Second Mode
sv: Andra läget

source: Capture a macro for this button
sv: Spela in makro för den här knappen

source: Visit Piper on GitHub
sv: Besök Piper på GitHub

source: Remove this profile from the device
sv: Ta bort den här profilen från enheten

source: Incompatible ratbagd API version (required: {e.required_version}, provided: {e.ratbagd_version})
sv: Inkompatibel ratbagd API-version (krävs: {e.required_version}, tillhandahålls: {e.ratbagd_version})

source: Select a Device
sv: Välj en enhet

source: Report rate
sv: Poll frekvens

source: Off
sv: Av

source: There are unapplied changes. Are you sure you want to quit?
sv: Det finns ej utförda förändringar. Är du säker på att du vill avsluta?

source: Please make sure your device is supported and plugged in
sv: Se till att din enhet stöds och är ansluten

source: Doubleclick
sv: Dubbelklick

source: Here, rodent, rodent, rodent…
sv: Hit, gnagare, gnagare, gnagare…

source: Forward
sv: Framåt

source: Pick a Color for the LED
sv: Välj en färg för lysdioden

source: Left mouse button click
sv: Vänster musklick

source: Disable
sv: Inaktivera

source: Breathing
sv: Pulserande

source: Wheel Up
sv: Mushjul Upp

source: Advanced
sv: Avancerat

source: Button mapping
sv: Knappbindning

source: Something went wrong. The device has been reset to a previous state.
sv: Något gick fel. Enheten återställdes till ett tidigare tillstand.

source: Send keystroke
sv: Skicka knapptryckning

source: Set the device’s handedness.
sv: Ställ in enheten för vänster eller höger-hänthet.

source: Open the configuration dialog
sv: Öppna konfigurationsdialogen

source: Cannot connect to ratbagd
sv: Kan inte ansluta till ratbagd

source: Please make sure ratbagd is running and your user is in the required group
sv: Se till att ratbagd körs och att användaren är i den riktiga gruppen

source: Cycle Resolution Down
sv: Cykla upplösning ner

source: Please make sure your device is plugged in
sv: Se till att din enhet är ansluten

source: The left mouse button generates a right mouse click
sv: Den vänstra musknappen genererar ett högerklick

source: Resolution Up
sv: Upplösning upp

source: Please update to the latest available version
sv: Uppdatera till senaste versionen

source: Battery Level
sv: Batterinivå

source: Ignore any changes made
sv: Ignorera eventuella ändringar

source: Change the profile’s report rate
sv: Ändra profilens poll frekvens

source: Configure button {}
sv: Konfigurera knapp {}

source: Enter a new key sequence for the macro.
sv: Ange en ny nyckelsekvens för makrot.

source: libratbag developers
sv: libratbags utvecklare

source: This LED is off
sv: Den här lysdioden är av

source: Wheel Down
sv: Mushjul Ner

source: Ratchet Mode
sv: Spärrläge

source: _About Piper
sv: _Om

source: Gaming mouse configuration utility
sv: Konfigurationsverktyg för spelmus

source: Key: {}
sv: Tangent: {}

source: The resolution configuraton page
sv: Öppna konfigurationsdialogen för upplösningar

source: Add profile
sv: Lägg till profil

source: Color
sv: Färg

source: This allows you to swap the order of the primary mouse buttons. In left-handed mode, the physical left mouse button generates a right mouse click and vice versa.
sv: Detta låter dig skifta ordningen på de primära musknapparna. I vänsterhänt läge genererar den vänstra musknappen ett högerklick och vice versa.

source: Unknown exception occurred
sv: Okänt fel av typ "exception" inträffade

source: Search for a button mapping
sv: Sök efter en knappbindning

source: Right mouse button click
sv: Höger musklick

source: Piper requires libratbag’s ratbagd, the daemon to actually communicate with the mice. Piper is merely a front end to ratbagd, ratbagd must be installed and running when Piper is launched.
sv: Piper behöver libratbags ratbagd, demonen som kommunicerar faktiskt med musen.Piper är bara ett användargränssnitt för ratbagd, ratbagd måste vara installerad och körs.

source: The left mouse button generates a left mouse click
sv: Den vänstra musknappen genererar ett vänsterklick

source: Angle snapping
sv: Vinkellåsning

source: translator-credits
sv: Patrik Nilsson och Stephan Lachnit

source: Wheel Left
sv: Mushjul vänster

source: Select another profile
sv: Välj en annan profil

source: Configurable mouse configuration utility
sv: Konfigurationsprogram för programmerbara möss

source: Cycle Profile Down
sv: Cykla profil ner

source: Buttons
sv: Knappar

source: Other
sv: Annat

source: Choose a brightness for the LED
sv: Välj en ljusstyrka för lysdioden

source: Commit the changes to the device
sv: Utför förändringarna i enheten

source: Backward
sv: Bakåt

source: Disable this resolution
sv: Inaktivera denna upplösning

source: Select a device to configure it
sv: Välj en enhet för att konfigurera den

source: Add a new profile to the device
sv: Lägg till en ny profil till enheten

source: Try a different search
sv: Prova en annan sökning

source: None
sv: Ingen

source: Cycle
sv: Cykla

source: Cycle Profile Up
sv: Cykla profil upp

source: Choose a color for the LED
sv: Välj en färg för lysdioden

source: LEDs
sv: Lysdioder

source: Default Resolution
sv: Standardupplösning

source: Middle mouse button click
sv: Mellersta musklick

source: Debounce time
sv: Studstid

source: Welcome
sv: Välkommen

source: Set active
sv: Aktivera

source: Apply any changes made
sv: Tillämpa eventuella ändringar

source: Please restart Piper
sv: Starta om Piper

source: Set this resolution as active
sv: Ange denna upplösning som aktiv

source: Resolution Switch
sv: Växla upplösning

source: Click to switch to another profile
sv: Klicka för att växla till en annan profil

source: Resolution Down
sv: Upplösning ner

source: Please update both piper and libratbag to the latest versions
sv: Uppdatera både Piper och libratbag till den senaste versionen

source: Macro: {}
sv: Makro: {}

source: Your device disconnected!
sv: Anslutningen till din enhet bröts!

source: Add a new resolution to the profile
sv: Lägg till en ny upplösning för profilen

source: Right Handed
sv: Högerhänt

source: Cancel
sv: Avbryt

source: The currently set macro
sv: Det nuvarande inställda makrot

source: Set this resolution's DPI
sv: Ange den här upplösningens DPI

source: Ooops. ratbagd has disappeared
sv: Aj då. ratbagd är försvunnen

source: Effect duration
sv: Effektfrekvens

source: Button {} click
sv: Knapp {} klick

source: Newer version of ratbagd required
sv: Nyare version av ratbagd behövs

source: gaming;configuration;mouse;mice;
sv: gaming;spel;konfiguration;mus;möss;

source: The LED configuraton page
sv: Öppna konfigurationsdialogen för lysdioder

source: Disabled
sv: Inaktiverad

source: No button mapping found
sv: Ingen knappbindning hittades

source: Profile Up
sv: Profil upp

source: Brightness
sv: Ljusstyrka

source: Wheel Right
sv: Mushjul höger

source: Profile Down
sv: Profil ner

source: Apply
sv: Tillämpa

source: Cannot display device SVG
sv: Kan inte visa enhetens SVG

source: The button configuraton page
sv: Öppna konfigurationsdialogen för knappar

source: Resolutions
sv: Upplösningar

source: Cycle Resolution Up
sv: Cykla upplösning upp

source: Special mapping
sv: Speciell bindning

source: active
sv: aktiv

source: Unknown
sv: Okänd

source: Cannot find any devices
sv: Kan inte hitta några enheter

source: Left Handed
sv: Vänsterhänt

source: Invalid
sv: Ogiltig

source: Uh Oh! Something went wrong…
sv: Oj då! Något gick fel…
